# 导入模块

In [1]:
import pandas as pd
import numpy as np

In [21]:
import os

# 数据载入和观察数据

In [17]:
# 一个例子关于Series和DataFrame

temp1 = pd.Series(np.arange(5))
temp2 = pd.Series(np.arange(5,10))

In [7]:
# 使用Series构建DF

temp1 = pd.DataFrame(temp1, columns=['A'])
temp2 = pd.DataFrame(temp2, columns=['B'])

In [11]:
# 你可以单独创建DF然后合并
data = pd.concat([temp1, temp2], axis=1)

In [13]:
data.head(3)

   A  B
0  0  5
1  1  6
2  2  7

In [18]:
# 直接使用Series创建DF
data = pd.DataFrame({'A':temp1,'B':temp2})

In [19]:
data

   A  B
0  0  5
1  1  6
2  2  7
3  3  8
4  4  9

In [29]:
# 加载数据
os.listdir('../Datawhale_learning/hands_on_eda/hands-on-data-analysis/第一单元项目集合/')
os.chdir('../Datawhale_learning/hands_on_eda/hands-on-data-analysis/第一单元项目集合/')

In [32]:
train = pd.read_csv('train.csv')
train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [41]:
# 查看某列元素，有下面几种方式
(train.Survived == train['Survived']).any()
# train.loc[:,['Survived']]
# train.iloc[:,1]

True

In [59]:
test = pd.read_csv('test_1.csv',index_col=0)

In [60]:
test.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100

In [61]:
# 去除多余的列
test_col = test.columns.to_list()
train_col = train.columns.to_list()

In [62]:
# 使用集合更方便，集合相减即可
drop_col = list(set(test_col)-set(train_col))
drop_col

['a']

In [63]:
# 删除元素，注意设置axis=1删除列，否则会报错
test.drop(columns=drop_col, axis=1, inplace=True)

In [64]:
test.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [69]:
# 观察单独的几列
observe_col = set(train.columns.to_list())-set(['PassengerId','Name','Age','Ticket'])
train.loc[:,list(observe_col)].head(3)

  Embarked  Survived     Sex  SibSp     Fare  Pclass  Parch Cabin
0        S         0    male      1   7.2500       3      0   NaN
1        C         1  female      1  71.2833       1      0   C85
2        S         1  female      0   7.9250       3      0   NaN

In [73]:
# 选择年龄小于10岁的信息

train.loc[train.Age < 10,:].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.700,G6,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.125,NaN,Q

In [84]:
# 选择年龄在10-50之间的人们
# 注意布尔逻辑的组合。注意一定要加括号

mid_age = train.loc[(10 <= train.Age) & (train.Age < 50),:]
mid_age.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [87]:
mid_age.loc[100, ['Pclass','Sex']]

Pclass         3
Sex       female
Name: 100, dtype: object

In [97]:
# loc
mid_age.loc[[100, 105, 108], ['Pclass','Name','Sex']]

     Pclass                     Name     Sex
100       3  Petranec, Miss. Matilda  female
105       3    Mionoff, Mr. Stoytcho    male
108       3          Rekic, Mr. Tido    male

In [93]:
# 这里出现了索引貌似不对啊
mid_age.iloc[[100,105,108],[2, 3, 4]]

     Pclass                               Name   Sex
149       2  Byles, Rev. Thomas Roussel Davids  male
160       3           Cribb, Mr. John Hatfield  male
163       3                    Calic, Mr. Jovo  male

In [102]:
# 验证下发现果然是这样
mid_age.index.to_list()[100]

149

In [103]:
# 上面出现了iloc和loc索引的行数不一样
# loc使用的是查找行数，是根据名字来查找的，我要找100，这个100是名字是100，并不是列数是100

# 如何让iloc显示正确呢？只能重新设置索引

mid_age.index = range(mid_age.shape[0])

In [104]:
mid_age.iloc[[100,105,108],[2, 3, 4]]

     Pclass                               Name   Sex
100       2  Byles, Rev. Thomas Roussel Davids  male
105       3           Cribb, Mr. John Hatfield  male
108       3                    Calic, Mr. Jovo  male

In [106]:
# 现在这两个对得上了
mid_age.loc[[100, 105, 108], ['Pclass','Name','Sex']]

     Pclass                               Name   Sex
100       2  Byles, Rev. Thomas Roussel Davids  male
105       3           Cribb, Mr. John Hatfield  male
108       3                    Calic, Mr. Jovo  male